<a href="https://colab.research.google.com/github/yashwantganesh/AI-Lab/blob/master/AI%20Experiment_2_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

EXPERIMENT 2

PANDAS

importing the needed packages

In [ ]:
import pandas as pd
import numpy as np

1)Creating a dataframe manually

In [ ]:
import pandas as pd
import numpy as np
df=pd.DataFrame({"Roll No":["19PA1A0203","19PA1A0234","19PA1A0239"],"Name":["G.Prateek","G.Surya","G.Ganesh"]})
df

      Roll No       Name
0  19PA1A0203  G.Prateek
1  19PA1A0234    G.Surya
2  19PA1A0239   G.Ganesh

2)Importing data into a dataframe

In [ ]:

df=pd.read_csv("students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

3)Adding,Deleting,Modifying the rows/columns in a dataframe

3 (1)Adding a column

In [ ]:
host_day=pd.read_csv("hostlers_day_scholars.csv")
host_day.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [ ]:
df["hostlers/days scholar"]=host_day.values
df.head()

   Roll No Gender  ... placement status  hostlers/days scholar
0        1      M  ...       Not placed                      d
1        2      F  ...           Placed                      d
2        3      F  ...       Not placed                      d
3        4      M  ...       Not placed                      d
4        5      M  ...       Not placed                      h

[5 rows x 10 columns]

3(2)Deleting a column

In [ ]:
del df["registered_for_ Placement_Training"]
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
4        5      M       A  ...        17        Not placed                      h

[5 rows x 9 columns]

3(3)Adding a row

In [ ]:
df1=pd.DataFrame({"Roll No": [39],"Gender": ["M"],"Section": ["A"],"SSC Percentage": [89.6],"inter_Diploma_percentage": [96],"B.Tech_percentage": [80],"Backlogs": [0],"placement status": ["Placed"],"hostlers/days scholar": ["d"]},index=[38])
df1

    Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
38       39      M       A  ...         0            Placed                      d

[1 rows x 9 columns]

In [ ]:
df=df.append(df1)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
4        5      M       A  ...        17        Not placed                      h

[5 rows x 9 columns]

3(4)Deleting a row

In [ ]:
df=df.drop(3)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
4        5      M       A  ...        17        Not placed                      h
5        6      M       A  ...         6        Not placed                      h

[5 rows x 9 columns]

3(5)Modifying the elements

In [ ]:
df.loc[4,"hostlers/days scholar"]="d"
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
4        5      M       A  ...        17        Not placed                      d
5        6      M       A  ...         6        Not placed                      h

[5 rows x 9 columns]

4)Applying functions on a dataframe

In [ ]:
def per(x):
  if(x<70):
    return(x+0.05)
  else:
    return(x)

In [ ]:
df["B.Tech_percentage"]=df["B.Tech_percentage"].apply(per)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
4        5      M       A  ...        17        Not placed                      d
5        6      M       A  ...         6        Not placed                      h

[5 rows x 9 columns]

5) Iterations on dataframe

In [ ]:
for index,rows in df[df["B.Tech_percentage"]>=80].iterrows():
  print(rows["Roll No"],"-",rows["B.Tech_percentage"])

18 - 85.39
60 - 81.1
71 - 80.47
97 - 88.1
102 - 83.38
39 - 80.0

6) Accessing the elements from a dataframe

In [ ]:
df.loc[[2,4],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
2            67.0                      68.0
4             NaN                      65.5

7) Different ways to deal with NAâ€™s in dataframe

In [ ]:
df["SSC Percentage"]=df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
4        5      M       A  ...        17        Not placed                      d
5        6      M       A  ...         6        Not placed                      h

[5 rows x 9 columns]


8) Groupby operations on dataframe

In [ ]:
group=df.groupby("Gender")
group["B.Tech_percentage"].agg(np.mean)

Gender
F    71.216735
M    57.677059
Name: B.Tech_percentage, dtype: float64

9) Merging the dataframes

In [ ]:
df2=pd.read_csv("urban_rural.csv")
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [ ]:
df=pd.merge(df,df2,on="Roll No")
df.head()

   Roll No Gender Section  ...  placement status  hostlers/days scholar  Urban/Rural
0        1      M       A  ...        Not placed                      d        Urban
1        2      F       A  ...            Placed                      d        Rural
2        3      F       A  ...        Not placed                      d        Urban
3        5      M       A  ...        Not placed                      d        Urban
4        6      M       A  ...        Not placed                      h        Rural

[5 rows x 10 columns]